**Free
dec-d  msg         varchar(100);
msg = 'Hello, RPGLE World!';
msg = 'Hello, SQLRPGLE World!';
dsply msg;
*inlr = *on;
return;

// End of program
